FemDesign.Materials.TimberFactors
timber_factors_type

FemDesign.Materials.TimberFactors._gammaMU
gamma_m_u

FemDesign.Materials.TimberFactors._gammaMAs
gamma_m_as

FemDesign.Materials.TimberFactors._kdefU
kdef_U

FemDesign.Materials.TimberFactors._kdefSq
kdef_Sq

FemDesign.Materials.TimberFactors._kdefSf
kdef_Sf

FemDesign.Materials.TimberFactors._kdefSc
kdef_Sc

FemDesign.Materials.TimberFactors.ServiceClass
service_class

FemDesign.Materials.TimberFactors._systemFactor
system_factor

FemDesign.Materials.TimberFactors.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,FemDesign.Materials.TimberServiceClassEnum,System.Double)
Factors for Orthotropic shell and CLT timber materials.
gammaMU: Gamma M (U)
gammaMAs: Gamma M (Ua, Us)
kdefU: kdef (U, Ua, Us)
kdefSq: kdef (Sq)
kdefSf: kdef (Sf)
kdefSc: kdef (Sc)
serviceClass: Service Class
systemFactor: System Factor